import pandas as pd
import matplotlib.pyplot as plt

CCTV_FILE = "./data/CCTV_in_Seoul.csv"
CRIME_FILE = "./data/crime_in_Seoul.csv"
POP_FILE = "./data/population_in_Seoul.xls"

df_cctv = pd.read_csv(CCTV_FILE)
# print(df_cctv.info())

df_cctv = df_cctv.rename(columns={"기관명": "구별"})
# print(df_cctv.head())
#     구별    소계  2013년도 이전  2014년  2015년  2016년
# 0  강남구  2780       1292    430    584    932
# 1  강동구   773        379     99    155    377
# 2  강북구   748        369    120    138    204
# 3  강서구   884        388    258    184     81
# 4  관악구  1496        846    260    390    613

df_pop_seoul = pd.read_excel(POP_FILE)
# print(df_pop_seoul.head())

# clean up excel col and row
df_pop_seoul = pd.read_excel(
    POP_FILE,
    header=2,
    usecols="B,D,G,J,N",
)
# print(df_pop_seoul.head())
# 자치구           계        계.1       계.2   65세이상고령자
# 0   합계  10197604.0  9926968.0  270636.0  1321458.0
# 1  종로구    162820.0   153589.0    9231.0    25425.0
# 2   중구    133240.0   124312.0    8928.0    20764.0
# 3  용산구    244203.0   229456.0   14747.0    36231.0
# 4  성동구    311244.0   303380.0    7864.0    39997.0

df_pop_seoul.columns = ["구별", "인구수", "한국인", "외국인", "고령자"]
# print(df_pop_seoul.head())
#     구별         인구수        한국인       외국인        고령자
# 0   합계  10197604.0  9926968.0  270636.0  1321458.0
# 1  종로구    162820.0   153589.0    9231.0    25425.0
# 2   중구    133240.0   124312.0    8928.0    20764.0
# 3  용산구    244203.0   229456.0   14747.0    36231.0
# 4  성동구    311244.0   303380.0    7864.0    39997.0


# clean up na and unnecessary row
df_pop_seoul = df_pop_seoul.dropna()
df_pop_seoul = df_pop_seoul.drop([0])
# print(df_pop_seoul)


# simple no of cctv in order
st = df_cctv.sort_values("소계", ascending=False).head()
# print(st)
st = df_cctv.sort_values("소계").head()
# print(st)

#      구별    소계  2013년도 이전  2014년  2015년  2016년
# 0   강남구  2780       1292    430    584    932
# 18  양천구  2034       1843    142     30    467
# 14  서초구  1930       1406    157    336    398
# 21  은평구  1873       1138    224    278    468
# 20  용산구  1624       1368    218    112    398
#      구별   소계  2013년도 이전  2014년  2015년  2016년
# 9   도봉구  485        238    159     42    386
# 12  마포구  574        314    118    169    379
# 17  송파구  618        529     21     68    463
# 24  중랑구  660        509    121    177    109
# 23   중구  671        413    190     72    348


# 2013년도 기준, 2014, 2015, 2016년도 CCTV가 얼마나 많이 증가했는가?
df_cctv["최근증가율"] = (
    df_cctv["2014년"] + df_cctv["2015년"] + df_cctv["2016년"]
) / df_cctv["2013년도 이전"]
st = df_cctv.sort_values("최근증가율", ascending=False)
# print(st)
#       구별    소계  2013년도 이전  2014년  2015년  2016년     최근증가율
# 22   종로구  1002        464    314    211    630  2.489224
# 9    도봉구   485        238    159     42    386  2.466387
# 12   마포구   574        314    118    169    379  2.121019
# 8    노원구  1265        542     57    451    516  1.889299
# 1    강동구   773        379     99    155    377  1.664908
# 19  영등포구   904        495    214    195    373  1.579798
# 0    강남구  2780       1292    430    584    932  1.506192
# 4    관악구  1496        846    260    390    613  1.492908
# 23    중구   671        413    190     72    348  1.476998
# 11   동작구  1091        544    341    103    314  1.393382
# 3    강서구   884        388    258    184     81  1.347938
# 2    강북구   748        369    120    138    204  1.252033
# 17   송파구   618        529     21     68    463  1.043478
# 7    금천구  1015        674     51    269    354  1.000000
# 21   은평구  1873       1138    224    278    468  0.852373
# 15   성동구  1062        730     91    241    265  0.817808
# 24   중랑구   660        509    121    177    109  0.799607
# 10  동대문구  1294       1070     23    198    579  0.747664
# 6    구로구  1561       1142    173    246    323  0.649737
# 16   성북구  1464       1009     78    360    204  0.636274
# 14   서초구  1930       1406    157    336    398  0.633713
# 5    광진구   707        573     78     53    174  0.532286
# 20   용산구  1624       1368    218    112    398  0.532164
# 13  서대문구   962        844     50     68    292  0.485782
# 18   양천구  2034       1843    142     30    467  0.346717


# Population affect no of cctv
# ratio of foreign, elderly
df_pop_seoul["외국인비율"] = df_pop_seoul["외국인"] / df_pop_seoul["인구수"] * 100
df_pop_seoul["고령자비율"] = df_pop_seoul["고령자"] / df_pop_seoul["인구수"] * 100
# print(df_pop_seoul)

#       구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
# 1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
# 2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
# 3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
# 4    성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
# 5    광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849
# 6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322
# 7    중랑구  414503.0  409882.0   4621.0  56774.0  1.114829  13.696885
# 8    성북구  461260.0  449773.0  11487.0  64692.0  2.490353  14.025062
# 9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
# 10   도봉구  348646.0  346629.0   2017.0  51312.0  0.578524  14.717507
# 11   노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
# 12   은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
# 13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797
# 14   마포구  389649.0  378566.0  11083.0  48765.0  2.844355  12.515110
# 15   양천구  479978.0  475949.0   4029.0  52975.0  0.839413  11.036964
# 16   강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
# 17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
# 18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
# 19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
# 20   동작구  412520.0  400456.0  12064.0  56013.0  2.924464  13.578251
# 21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
# 22   서초구  450310.0  445994.0   4316.0  51733.0  0.958451  11.488308
# 23   강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
# 24   송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
# 25   강동구  453233.0  449019.0   4214.0  54622.0  0.929765  12.051638

data_result = pd.merge(df_cctv, df_pop_seoul, on="구별")
data_result = data_result.drop(["2013년도 이전", "2014년", "2015년", "2016년"], axis=1)
# print(data_result)


# ### 상관관계

# 두 변수 사이에 얼마나 연관성이 있는가

# X축 : 요인 (독립변수)

# Y축 : 타겟 (종속변수)

# - 상관계수
#     - 0.1 이하 : 거의 관계 없음, 무시 가능
#     - 0.1~0.3 : 약한 상관관계
#     - 0.3~0.7 : 뚜렷한 상관관계
#     - 0.7 이상 : 강한 상관관계

# 상관관계
cor = data_result[["고령자비율", "외국인비율", "인구수", "소계"]].corr()
# print(cor)

#           고령자비율     외국인비율       인구수        소계
# 고령자비율  1.000000  0.267348 -0.669462 -0.280786
# 외국인비율  0.267348  1.000000 -0.591939 -0.136074
# 인구수   -0.669462 -0.591939  1.000000  0.306342
# 소계    -0.280786 -0.136074  0.306342  1.000000

plt.scatter(
    data_result["인구수"],
    data_result["소계"],
)
plt.xlabel("인구수")
plt.ylabel("CCTV 소계")
plt.grid()
plt.show()
